#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("Проверка записи и проведения документов ""Приход товаров"" и ""Расход товаров""").ВТранзакции()
   	.ДобавитьТест("ПроверкаЗаписиДокументов", "Проверка записи документов", "Позитив")
	.ДобавитьТест("ПроверкаПроведенияДокументов", "Проверка проведения документов", "Позитив")
	.ДобавитьТест("ПроверкаКорректностиДвиженийДокументов", "Проверка корректности движений документов", "Позитив")
	;

КонецПроцедуры

Процедура ПроверкаЗаписиДокументов() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	ОсновныеДанные = Новый Структура();
	ОсновныеДанные.Вставить("Организация", Ютест.Данные().СоздатьЭлемент("Справочник.Организации"));
	ОсновныеДанные.Вставить("Валюта", Ютест.Данные().СоздатьЭлемент("Справочник.Валюты")); 
	ОсновныеДанные.Вставить("Склад", Ютест.Данные().СоздатьЭлемент("Справочник.Склады")); 
	ОсновныеДанные.Вставить("Поставщик", Ютест.Данные().СоздатьЭлемент("Справочник.Контрагенты"));
	ОсновныеДанные.Вставить("Покупатель", Ютест.Данные().СоздатьЭлемент("Справочник.Контрагенты"));
	ОсновныеДанные.Вставить("ВидЦен", Ютест.Данные().СоздатьЭлемент("Справочник.ВидыЦен"));
	
	Товар = Ютест.Данные().СоздатьЭлемент("Справочник.Товары"); 
	
	// 2. Выполнение функции.
	ДокументПриход = СоздатьДокументПриходТовара(ОсновныеДанные, Товар, 100, 5);
	ДокументРасход = СоздатьДокументРасходТовара(ОсновныеДанные, Товар, 150, 3);
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(ДокументПриход)
		.ИмеетТип("ДокументСсылка.ПриходТовара")
		.Свойство("Номер").Заполнено()
		;
		
	ЮТест.ОжидаетЧто(ДокументРасход)
		.ИмеетТип("ДокументСсылка.РасходТовара")
		.Свойство("Номер").Заполнено()
		;
		
КонецПроцедуры 

Процедура ПроверкаПроведенияДокументов() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	ОсновныеДанные = Новый Структура();
	ОсновныеДанные.Вставить("Организация", Ютест.Данные().СоздатьЭлемент("Справочник.Организации"));
	ОсновныеДанные.Вставить("Валюта", Ютест.Данные().СоздатьЭлемент("Справочник.Валюты")); 
	ОсновныеДанные.Вставить("Склад", Ютест.Данные().СоздатьЭлемент("Справочник.Склады")); 
	ОсновныеДанные.Вставить("Поставщик", Ютест.Данные().СоздатьЭлемент("Справочник.Контрагенты"));
	ОсновныеДанные.Вставить("Покупатель", Ютест.Данные().СоздатьЭлемент("Справочник.Контрагенты"));
	ОсновныеДанные.Вставить("ВидЦен", Ютест.Данные().СоздатьЭлемент("Справочник.ВидыЦен"));
	
	Товар = Ютест.Данные().СоздатьЭлемент("Справочник.Товары"); 
	
	// 2. Выполнение функции.
	ДокументПриход = СоздатьДокументПриходТовара(ОсновныеДанные, Товар, 100, 5);
	ДокументРасход = СоздатьДокументРасходТовара(ОсновныеДанные, Товар, 150, 8);
	
	// 3. Проверка результата 
	ПриходОбъект = ДокументПриход.ПолучитьОбъект();
	РасходОбъект = ДокументРасход.ПолучитьОбъект();
	
	// 3.1. Проверяем, что документы проводятся.
	ЮТест.ОжидаетЧто(ПриходОбъект)
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение)
		.НеВыбрасываетИсключение()
		;
		
	ЮТест.ОжидаетЧто(РасходОбъект)
		.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение).Параметр(РежимПроведенияДокумента.Оперативный)
		.НеВыбрасываетИсключение()
		;
		
	// 3.2. Проверяем наличие движений по регистрам накопления
    ИмяРегистраЗапасы = "РегистрНакопления.ТоварныеЗапасы";
	ИмяРегистраВзаиморасчеты = "РегистрНакопления.Взаиморасчеты";

	ОтборПриходЗапасы = ЮТест.Предикат()
	    .Реквизит("Регистратор").Равно(ДокументПриход)
		.Реквизит("Товар").Равно(Товар)
		.Реквизит("Склад").Равно(ОсновныеДанные.Склад)
	    .Получить();
	ОтборПриходВзаиморасчеты = ЮТест.Предикат()
	    .Реквизит("Регистратор").Равно(ДокументПриход)
		.Реквизит("Контрагент").Равно(ОсновныеДанные.Поставщик)
		.Реквизит("Валюта").Равно(ОсновныеДанные.Валюта)
	    .Получить();
		
	ОтборРасходЗапасы = ЮТест.Предикат()
	    .Реквизит("Регистратор").Равно(ДокументРасход)
		.Реквизит("Товар").Равно(Товар)
		.Реквизит("Склад").Равно(ОсновныеДанные.Склад)
	    .Получить();
	ОтборРасходВзаиморасчеты = ЮТест.Предикат()
	    .Реквизит("Регистратор").Равно(ДокументРасход)
		.Реквизит("Контрагент").Равно(ОсновныеДанные.Покупатель)
		.Реквизит("Валюта").Равно(ОсновныеДанные.Валюта)
	    .Получить();
		
	ЮТест.ОжидаетЧто(
   		ЮТЗапросы.ТаблицаСодержитЗаписи(ИмяРегистраЗапасы, ОтборПриходЗапасы))
    	.ЭтоИстина();
	ЮТест.ОжидаетЧто(
   		ЮТЗапросы.ТаблицаСодержитЗаписи(ИмяРегистраВзаиморасчеты, ОтборПриходВзаиморасчеты))
    	.ЭтоИстина();
	
	ЮТест.ОжидаетЧто(
   		ЮТЗапросы.ТаблицаСодержитЗаписи(ИмяРегистраЗапасы, ОтборРасходЗапасы))
    	.ЭтоИстина();
	ЮТест.ОжидаетЧто(
   		ЮТЗапросы.ТаблицаСодержитЗаписи(ИмяРегистраВзаиморасчеты, ОтборРасходВзаиморасчеты))
    	.ЭтоИстина();
		
КонецПроцедуры

Процедура ПроверкаКорректностиДвиженийДокументов() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	ОсновныеДанные = Новый Структура();
	ОсновныеДанные.Вставить("Организация", Ютест.Данные().СоздатьЭлемент("Справочник.Организации"));
	ОсновныеДанные.Вставить("Валюта", Ютест.Данные().СоздатьЭлемент("Справочник.Валюты")); 
	ОсновныеДанные.Вставить("Склад", Ютест.Данные().СоздатьЭлемент("Справочник.Склады"));
	// в данном случае Поставщик должен быть равен Покупатель, если мы хотим, чтобы остатки по РН Взаиморасчеты вышли в 0
	Контрагент = Ютест.Данные().СоздатьЭлемент("Справочник.Контрагенты");
	ОсновныеДанные.Вставить("Поставщик", Контрагент);
	ОсновныеДанные.Вставить("Покупатель", Контрагент);
	ОсновныеДанные.Вставить("ВидЦен", Ютест.Данные().СоздатьЭлемент("Справочник.ВидыЦен"));
	
	Товар = Ютест.Данные().СоздатьЭлемент("Справочник.Товары"); 
	
	// 2. Выполнение функции.
	Для Сч = 1 По 3 Цикл
		ДокументПриход = СоздатьДокументПриходТовара(ОсновныеДанные, Товар, 100, 4);
		ДокументПриход.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	Для Сч = 1 По 4 Цикл
		ДокументРасход = СоздатьДокументРасходТовара(ОсновныеДанные, Товар, 100, 3);
		ДокументРасход.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
		
	// 3. Проверка результата
	// Запрос по остаткам должен быть пустой, наличие самих записей уже проверяли по всем измерениям	
	ОписаниеЗапросаЗапасы = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапросаЗапасы.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы.Остатки";
	ОписаниеЗапросаЗапасы.Условия.Добавить("Товар = &Товар");
	ОписаниеЗапросаЗапасы.Условия.Добавить("Склад = &Склад");
	ОписаниеЗапросаЗапасы.ЗначенияПараметров.Вставить("Товар", Товар);
	ОписаниеЗапросаЗапасы.ЗначенияПараметров.Вставить("Склад", ОсновныеДанные.Склад);
	ОписаниеЗапросаЗапасы.ВыбираемыеПоля.Добавить("КоличествоОстаток");

	ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапросаЗапасы)).ЭтоИстина()
	   ;
	   
	ОписаниеЗапросаВзаиморасчеты = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапросаВзаиморасчеты.ИмяТаблицы = "РегистрНакопления.Взаиморасчеты.Остатки";
	ОписаниеЗапросаВзаиморасчеты.Условия.Добавить("Контрагент = &Контрагент");
	ОписаниеЗапросаВзаиморасчеты.Условия.Добавить("Валюта = &Валюта");
	ОписаниеЗапросаВзаиморасчеты.ЗначенияПараметров.Вставить("Контрагент", Контрагент);
	ОписаниеЗапросаВзаиморасчеты.ЗначенияПараметров.Вставить("Валюта", ОсновныеДанные.Валюта);
	ОписаниеЗапросаВзаиморасчеты.ВыбираемыеПоля.Добавить("СуммаОстаток");
	
	ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапросаВзаиморасчеты)).ЭтоИстина()
	   ;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьДокументПриходТовара(ОсновныеДанные, Товар, Цена, Количество)

	// Конструктор объекта 'Документ.ПриходТовара'
	ТестовыйДокумент = Ютест.Данные().КонструкторОбъекта("Документ.ПриходТовара")
		.ФикцияОбязательныхПолей()		
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Поставщик", ОсновныеДанные.Поставщик)
		.Установить("Склад", ОсновныеДанные.Склад)
		.Установить("Валюта", ОсновныеДанные.Валюта)
		.Установить("Организация", ОсновныеДанные.Организация)
		.ТабличнаяЧасть("Товары").ДобавитьСтроку()
			.Установить("Товар", Товар)
			.Установить("Цена", Цена)
			.Установить("Количество", Количество)
			.Установить("Сумма", Цена * Количество)
	.Записать()
	;
	
	Возврат ТестовыйДокумент;
	
КонецФункции

Функция СоздатьДокументРасходТовара(ОсновныеДанные, Товар, Цена, Количество)

	// Конструктор объекта 'Документ.ПриходТовара'
	ТестовыйДокумент = Ютест.Данные().КонструкторОбъекта("Документ.РасходТовара")
		.ФикцияОбязательныхПолей()		
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Покупатель", ОсновныеДанные.Покупатель)
		.Установить("Склад", ОсновныеДанные.Склад)
		.Установить("Валюта", ОсновныеДанные.Валюта)
		.Установить("ВидЦен", ОсновныеДанные.ВидЦен)
		.Установить("Организация", ОсновныеДанные.Организация)
		.ТабличнаяЧасть("Товары").ДобавитьСтроку()
			.Установить("Товар", Товар)
			.Установить("Цена", Цена)
			.Установить("Количество", Количество)
			.Установить("Сумма", Цена * Количество)
	.Записать()
	;
	
	Возврат ТестовыйДокумент;
	
КонецФункции


#КонецОбласти